Autodesk.Revit.DB.Events.RevitAPIEventArgs.IsCancelled
Indicates whether the event is being cancelled.
Remarks:
If the event is cancellable and an event delegate wishes to cancel the event, it may call the Cancel() method if it is available for a particular event's arguments.
Since:
2011

Autodesk.Revit.DB.Events.RevitAPIEventArgs.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Events.RevitAPIEventArgs.Cancellable
Indicates whether an event may be cancelled by an event delegate.
Remarks:
If Cancellable returns true, event delegates may cancel the command that
was announced by the event. To do so, a delegate may call the Cancel() method if it is available.
Typically, single-events and post-events (e.g. DocumentPrinted) are not cancellable,
while most pre-events (e.g. DocumentPrinting) are cancellable, except for special
conditions and situations, such as when the Revit application is being closed
or if an event is raised during another event.
Since:
2011

Autodesk.Revit.DB.Events.RevitAPIEventArgs
The class is used as base class for all event argument classes.
Since:
2011